performance/load/auth-load-test.yml
# Authentication Load Test Configuration
# Tests login/logout performance under various load conditions

config:
  target: 'http://localhost:5000'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 300
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up"
    
    # Sustained load phase
    - duration: 600
      arrivalRate: 50
      name: "Sustained load"
    
    # Peak load phase
    - duration: 300
      arrivalRate: 100
      name: "Peak load"
    
    # Cool-down phase
    - duration: 120
      arrivalRate: 100
      rampTo: 5
      name: "Cool-down"

  processor: "./processors/auth-processor.js"
  
  # Performance thresholds
  ensure:
    - http.response_time.p95: 2000  # 95% of requests under 2s
    - http.response_time.p99: 5000  # 99% of requests under 5s
    - http.request_rate: 45         # At least 45 requests/second
    - http.codes.200: 0.95          # 95% success rate
    - http.codes.401: 0.02          # Max 2% auth failures
    - http.codes.500: 0.001         # Max 0.1% server errors

scenarios:
  # Student login scenario
  - name: "Student Login Flow"
    weight: 40
    flow:
      - post:
          url: "/api/auth/login"
          headers:
            Content-Type: "application/json"
          json:
            email: "student{{ $randomInt(1, 1000) }}@test.com"
            password: "TestPassword123!"
          capture:
            - json: "$.tokens.accessToken"
              as: "accessToken"
            - json: "$.user.id"
              as: "userId"
          expect:
            - statusCode: 200
            - hasProperty: "tokens.accessToken"
      
      # Access protected endpoint
      - get:
          url: "/api/student/dashboard"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 200
      
      # Logout
      - post:
          url: "/api/auth/logout"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 200

  # Teacher login scenario
  - name: "Teacher Login Flow"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          headers:
            Content-Type: "application/json"
          json:
            email: "teacher{{ $randomInt(1, 100) }}@test.com"
            password: "TestPassword123!"
          capture:
            - json: "$.tokens.accessToken"
              as: "accessToken"
          expect:
            - statusCode: 200
      
      # Access teacher dashboard
      - get:
          url: "/api/teacher/dashboard"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 200
      
      # Access courses
      - get:
          url: "/api/teacher/courses"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 200
      
      # Logout
      - post:
          url: "/api/auth/logout"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 200

  # Admin login scenario
  - name: "Admin Login Flow"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          headers:
            Content-Type: "application/json"
          json:
            email: "admin{{ $randomInt(1, 10) }}@test.com"
            password: "TestPassword123!"
          capture:
            - json: "$.tokens.accessToken"
              as: "accessToken"
          expect:
            - statusCode: 200
      
      # Access admin dashboard
      - get:
          url: "/api/admin/dashboard"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 200
      
      # Access user management
      - get:
          url: "/api/admin/users"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 200
      
      # Logout
      - post:
          url: "/api/auth/logout"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 200

  # Failed login attempts
  - name: "Failed Login Attempts"
    weight: 10
    flow:
      - post:
          url: "/api/auth/login"
          headers:
            Content-Type: "application/json"
          json:
            email: "invalid@test.com"
            password: "WrongPassword"
          expect:
            - statusCode: 401
      
      # Try with correct email but wrong password
      - post:
          url: "/api/auth/login"
          headers:
            Content-Type: "application/json"
          json:
            email: "student1@test.com"
            password: "WrongPassword"
          expect:
            - statusCode: 401

# Custom metrics
plugins:
  metrics-by-endpoint:
    useOnlyRequestNames: true

  # Publish metrics to external monitoring
  publish-metrics:
    - type: statsd
      host: localhost
      port: 8125
      prefix: "autograde.load_test"

  # Memory and CPU monitoring
  expect:
    outputFormat: json
    
# Before and after hooks
before:
  flow:
    - log: "Starting authentication load test..."

after:
  flow:
    - log: "Authentication load test completed"